eclipse-threadx/getting-started/Renesas/RX65N_Cloud_Kit/lib/rx_driver_package/src/smc_gen/r_sci_iic_rx/src/r_sci_iic_rx.c
#if (1 == SCI_IIC_CFG_PARAM_CHECKING_ENABLE)
    sci_iic_return_t ret;

    /* ---- CHECK ARGUMENTS ---- */
    ret = r_sci_iic_check_arguments(p_sci_iic_info, SCI_IIC_MODE_CLOSE);

    if (SCI_IIC_SUCCESS != ret)
    {
        return ret;
    }
#endif

    /* Calls the API function. */
    sci_iic_close(p_sci_iic_info);

    /* ---- Hardware Unlock ---- */
    chk = R_BSP_HardwareUnlock(g_sci_iic_handles[p_sci_iic_info->ch_no]->prom->hd_lock);

    if (false == chk)
    {
        return SCI_IIC_ERR_LOCK_FUNC;
    }

    return SCI_IIC_SUCCESS;
} /* End of function R_SCI_IIC_Close() */

/***********************************************************************************************************************
 * Function Name: sci_iic_close
 * Description  : Resets the SCI_IIC driver.
 *              : After called the processing, channel status becomes "SCI_IIC_NO_INIT".
 *              : When starts the communication again, please call an initialization processing.
 * Arguments    : sci_iic_info_t * p_sci_iic_info    ; IIC Information
 **********************************************************************************************************************/
static void sci_iic_close (sci_iic_info_t * p_sci_iic_info)
{
    /* Disables IIC. */
    sci_iic_disable(p_sci_iic_info);

    /* Reset SCI I/O register. */
    r_sci_iic_clear_io_register(p_sci_iic_info);

    /* Updates the channel status. */
    sci_iic_set_ch_status(p_sci_iic_info, SCI_IIC_NO_INIT);

    r_sci_iic_power_off(p_sci_iic_info->ch_no);
} /* End of function sci_iic_close() */

/***********************************************************************************************************************
 * Function Name: R_SCI_IIC_GetVersion
 ******************************************************************************************************************/ /**
 * @brief Returns the current version of this module.
 * @return    Version number
 * @details   This function will return the version of the currently installed SCI (simple I2C mode) FIT module. The 
 *            version number is encoded where the top 2 bytes are the major version number and the bottom 2 bytes are 
 *            the minor version number. For example, Version 4.25 would be returned as 0x00040019.
 * @note      None
*/
uint32_t R_SCI_IIC_GetVersion (void)
{
    uint32_t const version = (SCI_IIC_VERSION_MAJOR << 16) | SCI_IIC_VERSION_MINOR;

    return version;
} /* End of function R_SCI_IIC_GetVersion() */

/***********************************************************************************************************************
 * Function Name: r_sci_iic_advance
 * Description  : Advances the IIC communication.
 *              : The return value shows the communication result. Refer to the return value.
 * Arguments    : sci_iic_info_t * p_sci_iic_info    ; IIC Information
 * Return Value : SCI_IIC_SUCCESS                    ; Successful operation
 *              ; SCI_IIC_ERR_INVALID_CHAN           ; channel number invalid for part
 *              : SCI_IIC_ERR_INVALID_ARG            ; Parameter error
 *              : SCI_IIC_ERR_BUS_BUSY               ; Bus busy
 *              ; SCI_IIC_ERR_OTHER                  ; Other error
 **********************************************************************************************************************/
sci_iic_return_t r_sci_iic_advance (sci_iic_info_t * p_sci_iic_info)
{
    sci_iic_return_t ret;

    /* Parameter check */
    if (NULL == p_sci_iic_info)
    {
        ret = SCI_IIC_ERR_INVALID_ARG;
    }
    else
    {
        /* Calls the API function. */
        ret = sci_iic_advance(p_sci_iic_info);
    }

    return ret;
} /* End of function r_sci_iic_advance() */

/***********************************************************************************************************************
 * Function Name: sci_iic_advance
 * Description  : Advances the IIC communication.
 *              : The return value shows the communication result. Refer to the return value.
 * Arguments    : sci_iic_info_t * p_sci_iic_info    ; IIC Information
 **********************************************************************************************************************/
static sci_iic_return_t sci_iic_advance (sci_iic_info_t * p_sci_iic_info)
{
    sci_iic_return_t ret;
    bool boolret;
    sci_regs_t pregs = g_sci_iic_handles[p_sci_iic_info->ch_no]->prom->regs;

    /* Checks the channel status. */
    ret = sci_iic_check_chstatus_advance(p_sci_iic_info);

    if (SCI_IIC_SUCCESS != ret)
    {
        return ret;
    }

    /* Event happened? */
    if (SCI_IIC_EV_INIT != g_sci_iic_handles[p_sci_iic_info->ch_no]->api_event)
    {
        /* IIC communication processing */
        ret = sci_iic_func_table(g_sci_iic_handles[p_sci_iic_info->ch_no]->api_event, p_sci_iic_info);

        if (SCI_IIC_SUCCESS == ret)
        {
            /* status value? */
            switch (g_sci_iic_ChStatus[p_sci_iic_info->ch_no])
            {
                /* Advances communication. (Not finished) */
                case SCI_IIC_COMMUNICATION :

                    /* Do Nothing */

                break;

                    /* Finished communication. */
                case SCI_IIC_FINISH :

                    /* Disables IIC. */
                    sci_iic_disable(p_sci_iic_info);

                    /* Place the SSCL pin & SSDA pin in the high-impedance state */
                    /* SIMR3 - I2C Mode Register 3
                     b7:b6  IICSCLS - SSCL Output Select - Place the SSCL pin in the high-impedance state.
                     b5:b4  IICSDAS - SSDA Output Select - Place the SSDA pin in the high-impedance state.
                     b3     IICSTIF - Issuing of Start, Restart, or Stop Condition Completed Flag
                     - There are no requests for generating conditions */
                    pregs->SIMR3.BIT.IICSTIF = SCI_IIC_IICSTIF_CLEAR;
                    pregs->SIMR3.BIT.IICSCLS = SCI_IIC_HI_Z_OUTPUT;
                    pregs->SIMR3.BIT.IICSDAS = SCI_IIC_HI_Z_OUTPUT;

                    /* WAIT_LOOP */
                    while (SCI_IIC_IICSTIF_CLEAR != pregs->SIMR3.BIT.IICSTIF)
                    {
                        /* nothing to do */
                    }

                    /* Checks the callback function. */
                    if (NULL != g_sci_iic_handles[p_sci_iic_info->ch_no]->psci_iic_info_ch->callbackfunc)
                    {
                        /* Calls the callback function. */
                        g_sci_iic_handles[p_sci_iic_info->ch_no]->psci_iic_info_ch->callbackfunc();
                    }
                    else
                    {
                        return SCI_IIC_ERR_INVALID_ARG;
                    }

                break;

                    /* NACK is occurred. */
                case SCI_IIC_NACK :

                    /* Waits the stop condition generation. */
                    boolret = sci_iic_stop_cond_wait(p_sci_iic_info);

                    /* Disables IIC. */
                    sci_iic_disable(p_sci_iic_info);

                    /* Place the SSCL pin & SSDA pin in the high-impedance state */
                    /* SIMR3 - I2C Mode Register 3
                     b7:b6  IICSCLS - SSCL Output Select - Place the SSCL pin in the high-impedance state.
                     b5:b4  IICSDAS - SSDA Output Select - Place the SSDA pin in the high-impedance state.
                     b3     IICSTIF - Issuing of Start, Restart, or Stop Condition Completed Flag
                     - There are no requests for generating conditions */
                    pregs->SIMR3.BIT.IICSTIF = SCI_IIC_IICSTIF_CLEAR;
                    pregs->SIMR3.BIT.IICSCLS = SCI_IIC_HI_Z_OUTPUT;
                    pregs->SIMR3.BIT.IICSDAS = SCI_IIC_HI_Z_OUTPUT;

                    /* WAIT_LOOP */
                    while (SCI_IIC_IICSTIF_CLEAR != pregs->SIMR3.BIT.IICSTIF)
                    {
                        /* nothing to do */
                    }

