eclipse-threadx/getting-started/Renesas/RX65N_Cloud_Kit/lib/rx_driver_package/src/smc_gen/r_sci_iic_rx/src/r_sci_iic_rx.c
                    /* Check the stop condition generation. */
                    if (SCI_IIC_TRUE == boolret)
                    {
                        ret = SCI_IIC_SUCCESS;
                    }
                    else
                    {
                        /* Updates the channel status. */
                        sci_iic_set_ch_status(p_sci_iic_info, SCI_IIC_ERROR);

                        ret = SCI_IIC_ERR_BUS_BUSY;
                    }

                    /* Checks callback function. */
                    if (NULL != g_sci_iic_handles[p_sci_iic_info->ch_no]->psci_iic_info_ch->callbackfunc)
                    {
                        /* Calls the callback function. */
                        g_sci_iic_handles[p_sci_iic_info->ch_no]->psci_iic_info_ch->callbackfunc();
                    }
                    else
                    {
                        return SCI_IIC_ERR_INVALID_ARG;
                    }

                break;

                default :

                    /* Checks the callback function. */
                    if (NULL != g_sci_iic_handles[p_sci_iic_info->ch_no]->psci_iic_info_ch->callbackfunc)
                    {
                        /* Calls the callback function. */
                        g_sci_iic_handles[p_sci_iic_info->ch_no]->psci_iic_info_ch->callbackfunc();
                    }
                    else
                    {
                        return SCI_IIC_ERR_INVALID_ARG;
                    }

                break;
            }
            return ret;
        }
        else
        {
            return SCI_IIC_ERR_OTHER;
        }
    }
    else
    {
        /* Event nothing. */
        /* During communication */
        return SCI_IIC_ERR_OTHER;
    }
} /* End of function sci_iic_advance() */

/***********************************************************************************************************************
 * Function Name: sci_iic_func_table
 * Description  : IIC Protocol Execution Processing. Executes the function which set in "pfunc".
 * Arguments    : sci_iic_api_event_t event          ; Event
 *              : sci_iic_info_t * p_sci_iic_info    ; IIC Information
 * Return Value : Refer to the each calling function.
 **********************************************************************************************************************/
static sci_iic_return_t sci_iic_func_table (sci_iic_api_event_t event, sci_iic_info_t * p_sci_iic_info)
{
    sci_iic_return_t ret = SCI_IIC_ERR_OTHER;
    sci_iic_return_t (*pFunc) (sci_iic_info_t *);
    sci_iic_api_status_t n_status;

    /* Acquires a now state. */
    n_status = g_sci_iic_handles[p_sci_iic_info->ch_no]->api_n_status;

    /* Checks the parameter. */
    if ((SCI_IIC_STS_MAX > n_status) && (SCI_IIC_EV_MAX > event))
    {
        /* Checks the appointed function. */
        if (NULL != gc_sci_iic_mtx_tbl[n_status][event].proc)
        {
            /* Sets the function. */
            pFunc = gc_sci_iic_mtx_tbl[n_status][event].proc;

            /* Event flag initialization. */
            g_sci_iic_handles[p_sci_iic_info->ch_no]->api_event = SCI_IIC_EV_INIT;

            /* Calls the status transition function. */
            ret = (*pFunc)(p_sci_iic_info);
        }
        else
        {
            /* Appointed function error */
            ret = SCI_IIC_ERR_OTHER;
        }
    }
    else
    {
        /* Appointed function error */
        ret = SCI_IIC_ERR_OTHER;
    }

    return ret;
} /* End of function sci_iic_func_table() */

/***********************************************************************************************************************
 * Function Name: sci_iic_init_driver
 * Description  : Initialize IIC Driver Processing (Func0)
 *              : Initializes the IIC registers. Sets the internal status.
 * Arguments    : sci_iic_info_t * p_sci_iic_info    ; IIC Information
 * Return Value : SCI_IIC_SUCCESS                    ; Successful operation, idle state
 **********************************************************************************************************************/
static sci_iic_return_t sci_iic_init_driver (sci_iic_info_t * p_sci_iic_info)
{
    /* Initializes the IIC registers. */
    /* Includes I/O register read operation at the end of the following function. */
    r_sci_iic_init_io_register(p_sci_iic_info);

    /* Sets the internal status. */
    sci_iic_set_internal_status(p_sci_iic_info, SCI_IIC_STS_IDLE);

    return SCI_IIC_SUCCESS;
} /* End of function sci_iic_init_driver() */

/***********************************************************************************************************************
 * Function Name: sci_iic_generate_start_cond
 * Description  : Generate Start Condition Processing (Func1).
 *                Checks bus busy. Sets the internal status. Generates the start condition.
 * Arguments    : sci_iic_info_t * p_sci_iic_info    ; IIC Information
 * Return Value : SCI_IIC_SUCCESS                    ; Successful operation, communication state
 *              : SCI_IIC_ERR_BUS_BUSY               ; None reply error
 **********************************************************************************************************************/
static sci_iic_return_t sci_iic_generate_start_cond (sci_iic_info_t * p_sci_iic_info)
{
    sci_iic_return_t ret = SCI_IIC_SUCCESS;
    R_BSP_VOLATILE_EVENACCESS uint8_t * const ppidr = SCI_IIC_PRV_PIDR_BASE_REG;
    R_BSP_VOLATILE_EVENACCESS const sci_iic_ch_rom_t * prom = g_sci_iic_handles[p_sci_iic_info->ch_no]->prom;

    uint8_t sscl_port_gr;
    uint8_t sscl_port_pin;
    uint8_t ssda_port_gr;
    uint8_t ssda_port_pin;
    
    /* Check Bus busy(SSDA,SSCL pin level) */
    sscl_port_gr = prom->sscl_port_gr;
    sscl_port_pin = prom->sscl_port_pin;
    ssda_port_gr = prom->ssda_port_gr;
    ssda_port_pin = prom->ssda_port_pin;
    if ((SCI_IIC_LOW == ((*(ppidr + sscl_port_gr)) & (1U << sscl_port_pin)))
            || (SCI_IIC_LOW == ((*(ppidr + ssda_port_gr)) & (1U << ssda_port_pin))))
    {
        return SCI_IIC_ERR_BUS_BUSY;
    }

