eclipse-threadx/getting-started/Renesas/RX65N_Cloud_Kit/lib/rx_driver_package/src/smc_gen/r_sci_iic_rx/src/r_sci_iic_rx.c
    /* Sets the internal status. */
    sci_iic_set_internal_status(p_sci_iic_info, SCI_IIC_STS_ST_COND_WAIT);

    /* Generates the start condition.*/
    sci_iic_start_cond_generate(p_sci_iic_info);

    return ret;
} /* End of function sci_iic_generate_start_cond() */

/***********************************************************************************************************************
 * Function Name: sci_iic_after_gen_start_cond
 * Description  : After Start Condition Generation Processing (Func2).
 *                Performs one of the following processing according to the state.
 *                Transmits the slave address for writing.
 *                Transmits the slave address for reading.
 *                Generates the stop condition.
 * Arguments    : sci_iic_info_t * p_sci_iic_info    ; IIC Information
 * Return Value : SCI_IIC_SUCCESS                    ; Successful operation, communication state
 *              : SCI_IIC_ERR_OTHER                  ; Other error
 **********************************************************************************************************************/
static sci_iic_return_t sci_iic_after_gen_start_cond (sci_iic_info_t * p_sci_iic_info)
{
    sci_iic_return_t ret = SCI_IIC_SUCCESS;
    uint8_t buf_send_data;
    sci_regs_t pregs = g_sci_iic_handles[p_sci_iic_info->ch_no]->prom->regs;

    switch (g_sci_iic_handles[p_sci_iic_info->ch_no]->api_mode)
    {
        case SCI_IIC_MODE_SEND :
        case SCI_IIC_MODE_SEND_RECEIVE :

            /* Checks the previous status. */
            switch (g_sci_iic_handles[p_sci_iic_info->ch_no]->api_b_status)
            {
                /* The previous status is idle. */
                case SCI_IIC_STS_IDLE :

                    /* Is the slave address pointer set? */
                    if ((uint8_t *) FIT_NO_PTR == p_sci_iic_info->p_slv_adr) /* Pattern 4 of Master Write  */
                    {
                        /* Sets the internal status. */
                        sci_iic_set_internal_status(p_sci_iic_info, SCI_IIC_STS_SP_COND_WAIT);

                        /* Generates the stop condition. */
                        sci_iic_stop_cond_generate(p_sci_iic_info);

                        return ret;
                    }

                    /* Sets a write code. */
                    buf_send_data = (uint8_t) ((*p_sci_iic_info->p_slv_adr) << 1);
                    buf_send_data &= SCI_IIC_W_CODE;

                    /* Sets the internal status. */
                    sci_iic_set_internal_status(p_sci_iic_info, SCI_IIC_STS_SEND_SLVADR_W_WAIT);

                    /* Enables the IIC bus interrupt. */
                    /* SIMR3 - I2C Mode Register 3
                     b7:b6  IICSCLS - SSCL Output Select - Serial clock output.
                     b5:b4  IICSDAS - SSDA Output Select - Serial data output.
                     b3     IICSTIF - Issuing of Start, Restart, or Stop Condition Completed Flag
                     - There are no requests for generating conditions */
                    pregs->SIMR3.BIT.IICSTIF = SCI_IIC_IICSTIF_CLEAR;
                    pregs->SIMR3.BIT.IICSCLS = SCI_IIC_CLOCK_OUTPUT;
                    pregs->SIMR3.BIT.IICSDAS = SCI_IIC_CLOCK_OUTPUT;

                    /* WAIT_LOOP */
                    while (SCI_IIC_IICSTIF_CLEAR != pregs->SIMR3.BIT.IICSTIF)
                    {
                        /* nothing to do */
                    }

                    sci_iic_set_sending_data(p_sci_iic_info, &buf_send_data);

                break;

                    /* Previous status is data transfer completion waiting status. */
                case SCI_IIC_STS_SEND_DATA_WAIT :

                    /* Sets a read code. */
                    buf_send_data = (uint8_t) ((*p_sci_iic_info->p_slv_adr) << 1);
                    buf_send_data |= SCI_IIC_R_CODE;

                    /* Sets the internal status. */
                    sci_iic_set_internal_status(p_sci_iic_info, SCI_IIC_STS_SEND_SLVADR_R_WAIT);

                    /* Enables the IIC bus interrupt. */
                    /* SIMR3 - I2C Mode Register 3
                     b7:b6  IICSCLS - SSCL Output Select - Serial clock output.
                     b5:b4  IICSDAS - SSDA Output Select - Serial data output.
                     b3     IICSTIF - Issuing of Start, Restart, or Stop Condition Completed Flag
                     - There are no requests for generating conditions */
                    pregs->SIMR3.BIT.IICSTIF = SCI_IIC_IICSTIF_CLEAR;
                    pregs->SIMR3.BIT.IICSCLS = SCI_IIC_CLOCK_OUTPUT;
                    pregs->SIMR3.BIT.IICSDAS = SCI_IIC_CLOCK_OUTPUT;

                    /* WAIT_LOOP */
                    while (SCI_IIC_IICSTIF_CLEAR != pregs->SIMR3.BIT.IICSTIF)
                    {
                        /* nothing to do */
                    }

                    /* Transmits the slave address. */
                    sci_iic_set_sending_data(p_sci_iic_info, &buf_send_data);
                break;

                default :

                    /* None status. */
                    ret = SCI_IIC_ERR_OTHER;

                break;
            }
            return ret;

        case SCI_IIC_MODE_RECEIVE :

            /* Sets a read code. */
            buf_send_data = (uint8_t) ((*p_sci_iic_info->p_slv_adr) << 1);
            buf_send_data |= SCI_IIC_R_CODE;

            /* Sets the internal status. */
            sci_iic_set_internal_status(p_sci_iic_info, SCI_IIC_STS_SEND_SLVADR_R_WAIT);

            /* Enables the IIC bus interrupt. */
            /* SIMR3 - I2C Mode Register 3
             b7:b6  IICSCLS - SSCL Output Select - Serial clock output.
             b5:b4  IICSDAS - SSDA Output Select - Serial data output.
             b3     IICSTIF - Issuing of Start, Restart, or Stop Condition Completed Flag
             - There are no requests for generating conditions */
            pregs->SIMR3.BIT.IICSTIF = SCI_IIC_IICSTIF_CLEAR;
            pregs->SIMR3.BIT.IICSCLS = SCI_IIC_CLOCK_OUTPUT;
            pregs->SIMR3.BIT.IICSDAS = SCI_IIC_CLOCK_OUTPUT;

            /* WAIT_LOOP */
            while (SCI_IIC_IICSTIF_CLEAR != pregs->SIMR3.BIT.IICSTIF)
            {
                /* nothing to do */
            }

            /* Transmits the slave address. */
            sci_iic_set_sending_data(p_sci_iic_info, &buf_send_data);
        break;

        default :
            ret = SCI_IIC_ERR_OTHER;
        break;
    }
    return ret;
} /* End of function sci_iic_after_gen_start_cond() */

