eclipse-threadx/getting-started/Renesas/RX65N_Cloud_Kit/lib/rx_driver_package/src/smc_gen/r_sci_iic_rx/src/r_sci_iic_rx.c
/***********************************************************************************************************************
 * Function Name: sci_iic_after_send_slvadr
 * Description  : After Slave Address Transmission Processing (Func3).
 *                Performs one of the following processing according to the state.
 *                Transmits a data. Generates the stop condition. Receives a data.
 * Arguments    : sci_iic_info_t * p_sci_iic_info    ; IIC Information
 * Return Value : SCI_IIC_SUCCESS                    ; Successful operation, communication state
 *              : SCI_IIC_ERR_OTHER                  ; Other error
 **********************************************************************************************************************/
static sci_iic_return_t sci_iic_after_send_slvadr (sci_iic_info_t * p_sci_iic_info)
{
    sci_iic_return_t ret = SCI_IIC_SUCCESS;
    volatile uint8_t uctmp = 0U;
    sci_regs_t pregs = g_sci_iic_handles[p_sci_iic_info->ch_no]->prom->regs;

    switch (g_sci_iic_handles[p_sci_iic_info->ch_no]->api_mode)
    {
        case SCI_IIC_MODE_SEND : /* MasterSend  */

            /* Are 1st data and 2nd data pointer set? */
            /* Pattern 3 of Master Write    */
            if (((uint8_t *) FIT_NO_PTR == p_sci_iic_info->p_data1st)
                    && ((uint8_t *) FIT_NO_PTR == p_sci_iic_info->p_data2nd))
            {
                /* Sets the internal status. */
                sci_iic_set_internal_status(p_sci_iic_info, SCI_IIC_STS_SP_COND_WAIT);

                /* Generates the stop condition. */
                sci_iic_stop_cond_generate(p_sci_iic_info);

                return ret;
            }

            /* Is 1st data pointer set? */
            if (((uint8_t *) FIT_NO_PTR != p_sci_iic_info->p_data1st)
                    && ((uint8_t *) FIT_NO_PTR != p_sci_iic_info->p_data2nd))
            {
                /* Pattern 1 of Master Write */
                /* Sets the internal status. */
                sci_iic_set_internal_status(p_sci_iic_info, SCI_IIC_STS_SEND_DATA_WAIT);

                /* 1st data counter = 0?  */
                if (0U != p_sci_iic_info->cnt1st)
                {
                    /* Transmits a 1st data. */
                    sci_iic_set_sending_data(p_sci_iic_info, p_sci_iic_info->p_data1st);

                    /* Decreases the 1st data counter.*/
                    p_sci_iic_info->cnt1st--;

                    /* Increases the 1st data buffer pointer. */
                    p_sci_iic_info->p_data1st++;
                }
                else
                {
                    return SCI_IIC_ERR_OTHER;
                }
            }
            else if (((uint8_t *) FIT_NO_PTR == p_sci_iic_info->p_data1st)
                    && ((uint8_t *) FIT_NO_PTR != p_sci_iic_info->p_data2nd))
            {
                /* Pattern 2 of Master Write */
                /* Sets the internal status. */
                sci_iic_set_internal_status(p_sci_iic_info, SCI_IIC_STS_SEND_DATA_WAIT);

                /* 2nd data counter = 0?  */
                if (0U != p_sci_iic_info->cnt2nd)
                {
                    /* Transmits a 2nd data. */
                    sci_iic_set_sending_data(p_sci_iic_info, p_sci_iic_info->p_data2nd);

                    /* Decreases the 2nd data counter. */
                    p_sci_iic_info->cnt2nd--;

                    /* Increases the 2nd data buffer pointer. */
                    p_sci_iic_info->p_data2nd++;

                }
                else
                {
                    return SCI_IIC_ERR_OTHER;
                }
            }
            else
            {
                return SCI_IIC_ERR_OTHER;
            }

        break;

        case SCI_IIC_MODE_RECEIVE :

            /* Sets the internal status. */
            sci_iic_set_internal_status(p_sci_iic_info, SCI_IIC_STS_RECEIVE_DATA_WAIT);

            if (1U >= p_sci_iic_info->cnt2nd)
            {
                /* Processing before receiving the "last byte - 1byte" in RX. */
                /* SIMR2 - I2C Mode Register 2
                 b7:b6  Reserved - These bits are read as 0.
                 b5     IICACKT - ACK Transmission Data - ACK transmission.
                 b4:b2  Reserved - These bits are read as 0.
                 b1     IICCSC - Clock Synchronization
                 b0     IICINTM - I2C Interrupt Mode Select - NACK translation */
                pregs->SIMR2.BIT.IICACKT = SCI_IIC_NACK_TRANS;
            }
            else
            {
                /* ACK transmission  */
                /* SIMR2 - I2C Mode Register 2
                 b0     IICINTM - I2C Interrupt Mode Select - ACK translation */
                pregs->SIMR2.BIT.IICACKT = SCI_IIC_ACK_TRANS;
            }

            /* Performs dummy read. */
            uctmp = sci_iic_get_receiving_data(p_sci_iic_info);

            p_sci_iic_info->cnt2nd--;

            /* Write Dummy date */
            /* TDR - Transmit Data Register */
            pregs->TDR = 0xff;

        break;

        case SCI_IIC_MODE_SEND_RECEIVE :

            /* Now status? */
            switch (g_sci_iic_handles[p_sci_iic_info->ch_no]->api_n_status)
            {

                case SCI_IIC_STS_SEND_SLVADR_W_WAIT :

                    /* Sets the internal status. */
                    sci_iic_set_internal_status(p_sci_iic_info, SCI_IIC_STS_SEND_DATA_WAIT);

                    /* Transmits a 1st data. */
                    sci_iic_set_sending_data(p_sci_iic_info, p_sci_iic_info->p_data1st);

                    /* Decreases the 1st data counter. */
                    p_sci_iic_info->cnt1st--;

                    /* Increases the 1st Data buffer pointer. */
                    p_sci_iic_info->p_data1st++;

                break;

                case SCI_IIC_STS_SEND_SLVADR_R_WAIT :

                    if (1U >= p_sci_iic_info->cnt2nd)
                    {
                        /* Processing before receiving the "last byte - 1byte" in RX. */
                        /* SIMR2 - I2C Mode Register 2
                         b7:b6  Reserved - These bits are read as 0.
                         b5     IICACKT - ACK Transmission Data - ACK transmission.
                         b4:b2  Reserved - These bits are read as 0.
                         b1     IICCSC - Clock Synchronization
                         b0     IICINTM - I2C Interrupt Mode Select - NACK translation */
                        pregs->SIMR2.BIT.IICACKT = SCI_IIC_NACK_TRANS;
                    }
                    else
                    {
                        /* ACK transmission  */
                        /* SIMR2 - I2C Mode Register 2
                         b0     IICINTM - I2C Interrupt Mode Select - ACK translation */
                        pregs->SIMR2.BIT.IICACKT = SCI_IIC_ACK_TRANS;
                    }

