eclipse-threadx/getting-started/Renesas/RX65N_Cloud_Kit/lib/rx_driver_package/src/smc_gen/r_sci_iic_rx/src/r_sci_iic_rx.c
        /* Write Dummy date */
        /* TDR - Transmit Data Register */
        pregs->TDR = 0xff;
    }

    return ret;
} /* End of function sci_iic_read_data_receiving() */

/***********************************************************************************************************************
 * Function Name: sci_iic_release
 * Description  : After Generating Stop Condition Processing (Func6).
 *                Checks bus busy.
 * Arguments    : sci_iic_info_t * p_sci_iic_info    ; IIC Information
 * Return Value : SCI_IIC_SUCCESS                    ; Successful operation, finished communication and idle state
 **********************************************************************************************************************/
static sci_iic_return_t sci_iic_release (sci_iic_info_t * p_sci_iic_info)
{
    sci_iic_return_t ret = SCI_IIC_SUCCESS;

    /* Updates the channel status. */
    sci_iic_set_ch_status(p_sci_iic_info, SCI_IIC_FINISH);

    return ret;
} /* End of function sci_iic_release() */

/***********************************************************************************************************************
 * Function Name: sci_iic_nack
 * Description  : Nack Error Processing (Func7).
 *                Generates the stop condition and returns SCI_IIC_NACK.
 * Arguments    : sci_iic_info_t * p_sci_iic_info    ; IIC Information
 * Return Value : SCI_IIC_SUCCESS                    ; Detected NACK, finished communication and idle state
 **********************************************************************************************************************/
static sci_iic_return_t sci_iic_nack (sci_iic_info_t * p_sci_iic_info)
{
    sci_iic_return_t ret = SCI_IIC_SUCCESS;
    volatile uint8_t uctmp = 0U;

    /* Sets the internal status. */
    sci_iic_set_internal_status(p_sci_iic_info, SCI_IIC_STS_SP_COND_WAIT);

    /* Enables the IIC bus interrupt. */
    sci_iic_int_icier_setting(p_sci_iic_info, SCI_IIC_SCR_ENABLE);

    /* Generates the stop condition. */
    sci_iic_stop_cond_generate(p_sci_iic_info);

    /* Checks the internal mode. */
    if ((SCI_IIC_MODE_RECEIVE == g_sci_iic_handles[p_sci_iic_info->ch_no]->api_mode)
            || (SCI_IIC_MODE_SEND_RECEIVE == g_sci_iic_handles[p_sci_iic_info->ch_no]->api_mode))
    {
        /* Dummy Read */
        /* Refer to the RX User's Manual. */
        uctmp = sci_iic_get_receiving_data(p_sci_iic_info);
    }

    /* Updates the channel status. */
    sci_iic_set_ch_status(p_sci_iic_info, SCI_IIC_NACK);

    return ret;
} /* End of function sci_iic_nack() */

/***********************************************************************************************************************
 * Function Name: sci_iic_api_status_init
 * Description  : Initializes RAM.
 * Arguments    : sci_iic_info_t * p_sci_iic_info    ; IIC Information
 * Return Value : None
 **********************************************************************************************************************/
static void sci_iic_api_status_init (sci_iic_info_t * p_sci_iic_info)
{
    /* Clears the event flag. */
    g_sci_iic_handles[p_sci_iic_info->ch_no]->api_event = SCI_IIC_EV_INIT;

    /* Sets the mode to SCI_IIC_MODE_NONE. */
    g_sci_iic_handles[p_sci_iic_info->ch_no]->api_mode = SCI_IIC_MODE_NONE;
} /* End of function sci_iic_api_status_init() */

/***********************************************************************************************************************
 * Function Name: sci_iic_set_internal_status
 * Description  : Update Internal Status Processing.
 *                Updates the now status and the previous status.
 * Arguments    : sci_iic_info_t * p_sci_iic_info    ; IIC Information
 *              : sci_iic_api_status_t new_status    ; New status
 * Return Value : None
 **********************************************************************************************************************/
static void sci_iic_set_internal_status (sci_iic_info_t * p_sci_iic_info, sci_iic_api_status_t new_status)
{
    /* Sets the previous status. */
    g_sci_iic_handles[p_sci_iic_info->ch_no]->api_b_status = g_sci_iic_handles[p_sci_iic_info->ch_no]->api_n_status;

    /* Sets the now status. */
    g_sci_iic_handles[p_sci_iic_info->ch_no]->api_n_status = new_status;
} /* End of function sci_iic_set_internal_status() */

/***********************************************************************************************************************
 * Function Name: sci_iic_set_ch_status
 * Description  : Updates the channel status.
 * Arguments    : sci_iic_info_t * p_sci_iic_info    ; IIC Information
 * Return Value : None
 **********************************************************************************************************************/
static void sci_iic_set_ch_status (sci_iic_info_t * p_sci_iic_info, sci_iic_ch_dev_status_t status)
{
    /* Sets the channel status. */
    g_sci_iic_ChStatus[p_sci_iic_info->ch_no] = status;

    /* Sets the device status. */
    p_sci_iic_info->dev_sts = status;
} /* End of function sci_iic_set_ch_status() */

/***********************************************************************************************************************
 * Function Name: sci_iic_check_chstatus_start
 * Description  : Check Channel Status Processing (at Start Function)
 *                When calls the starting function, checks the channel status.
 * Arguments    : sci_iic_info_t * p_sci_iic_info    ; IIC Information
 * Return Value : SCI_IIC_SUCCESS                    ; Successful operation
 *              : SCI_IIC_ERR_NO_INIT                ; Uninitialized state
 *              : SCI_IIC_ERR_BUS_BUSY               ; Bus busy
 *              ; SCI_IIC_ERR_OTHER                  ; Other error
 **********************************************************************************************************************/
static sci_iic_return_t sci_iic_check_chstatus_start (sci_iic_info_t * p_sci_iic_info)
{
    sci_iic_return_t ret = SCI_IIC_ERR_OTHER;

    /* Checks the channel status. */
    switch (g_sci_iic_ChStatus[p_sci_iic_info->ch_no])
    {
        case SCI_IIC_NO_INIT :

            /* It is necessary to reinitialize. */
            /* Sets the return value to uninitialized state. */
            ret = SCI_IIC_ERR_NO_INIT;

        break;

        case SCI_IIC_IDLE :
        case SCI_IIC_FINISH :
        case SCI_IIC_NACK :

            /* Checks the device status. */
            if ((((SCI_IIC_NO_INIT == p_sci_iic_info->dev_sts) || (SCI_IIC_IDLE == p_sci_iic_info->dev_sts))
                    || (SCI_IIC_FINISH == p_sci_iic_info->dev_sts)) || (SCI_IIC_NACK == p_sci_iic_info->dev_sts))
            {
                /* Sets the return value to success state. */
                ret = SCI_IIC_SUCCESS;
            }
            else if (SCI_IIC_COMMUNICATION == p_sci_iic_info->dev_sts)
            {
                /* Another device performed a driver reset processing
                 when this device is in idle state or communicating state. */
                /* It is necessary to reinitialize. */
                /* Sets the return value to uninitialized state. */
                ret = SCI_IIC_ERR_BUS_BUSY;
            }
            else
            {
                /* The device is in uninitialized state, idle state or error state. */
                ret = SCI_IIC_ERR_OTHER;
            }

        break;

        case SCI_IIC_COMMUNICATION :

            /* The device or another device is on communication. */
            /* Sets the return value to bus busy state. */
            ret = SCI_IIC_ERR_BUS_BUSY;

        break;

        default :

            ret = SCI_IIC_ERR_OTHER;

        break;
    }

    return ret;
} /* End of function sci_iic_check_chstatus_start() */

