eclipse-threadx/getting-started/Renesas/RX65N_Cloud_Kit/lib/rx_driver_package/src/smc_gen/r_sci_iic_rx/src/r_sci_iic_rx.c
    if ((SCI_IIC_STPREQ == g_sci_iic_handles[p_sci_iic_info->ch_no]->mode) && (1 == pregs->SIMR3.BIT.IICSTIF))
    {
        boolret = SCI_IIC_TRUE;
    }
    else
    {
        boolret = SCI_IIC_FALSE;
    }

    return boolret;
} /* End of function sci_iic_check_stop_event() */

/***********************************************************************************************************************
 * Outline      : Set ICIER Register Processing -> Set SCR Register Processing
 * Function Name: sci_iic_int_icier_setting
 * Description  : Sets an interrupt condition of SCI_IIC.
 * Arguments    : sci_iic_info_t * p_sci_iic_info         ;   IIC Information
 *              : uint8_t new_status                      ;   New status
 * Return Value : None
 **********************************************************************************************************************/
static void sci_iic_int_icier_setting (sci_iic_info_t * p_sci_iic_info, uint8_t New_icier)
{
    sci_regs_t pregs = g_sci_iic_handles[p_sci_iic_info->ch_no]->prom->regs;

    /* Sets ICIER register. */
    pregs->SCR.BYTE = New_icier;
} /* End of function sci_iic_int_icier_setting() */

/***********************************************************************************************************************
 * Function Name: sci_iic_start_cond_generate
 * Description  : Generate Start Condition Processing.
 *                Sets SCR register and SIMR3 register.
 * Arguments    : sci_iic_info_t * p_sci_iic_info     ;   IIC Information
 * Return Value : None
 **********************************************************************************************************************/
static void sci_iic_start_cond_generate (sci_iic_info_t * p_sci_iic_info)
{
    sci_regs_t pregs = g_sci_iic_handles[p_sci_iic_info->ch_no]->prom->regs;

    g_sci_iic_handles[p_sci_iic_info->ch_no]->mode = SCI_IIC_STAREQ; /* mode set start mode.*/

    /* SCR - Serial Control Register
     b5     TE - Transmit Enable - Serial transmission is enabled
     b4     RE - Transmit Enable - Serial reception is enabled */
    pregs->SCR.BYTE |= SCI_IIC_SCR_TE_RE;

    /* SIMR3 - I2C Mode Register 3
     b7:b6  IICSCLS - SSCL Output Select - Generate a start, restart, or stop condition.
     b5:b4  IICSDAS - SSDA Output Select - Generate a start, restart, or stop condition.
     b3     IICSTIF - Issuing of Start, Restart, or Stop Condition Completed Flag
     - There are no requests for generating conditions
     b0     IICSTAREQ - Start Condition Generation   - A start condition is not generated. */
    pregs->SIMR3.BYTE = SCI_IIC_ST_CON_GENERATED;
} /* End of function sci_iic_start_cond_generate() */

/***********************************************************************************************************************
 * Function Name: sci_iic_re_start_cond_generate
 * Description  : Generate Restart Condition Processing.
 *                Sets SCR register and SIMR3 register.
 * Arguments    : sci_iic_info_t * p_sci_iic_info     ;   IIC Information
 * Return Value : None
 **********************************************************************************************************************/
static void sci_iic_re_start_cond_generate (sci_iic_info_t * p_sci_iic_info)
{
    sci_regs_t pregs = g_sci_iic_handles[p_sci_iic_info->ch_no]->prom->regs;

    g_sci_iic_handles[p_sci_iic_info->ch_no]->mode = SCI_IIC_RSTAREQ; /* mode set restart mode. */

    /* SCR - Serial Control Register
     b5     TE - Transmit Enable - Serial transmission is enabled
     b4     RE - Transmit Enable - Serial reception is enabled */
    pregs->SCR.BYTE |= SCI_IIC_SCR_TE_RE;

    /* SIMR3 - I2C Mode Register 3
     b7:b6  IICSCLS - SSCL Output Select - Generate a start, restart, or stop condition.
     b5:b4  IICSDAS - SSDA Output Select - Generate a start, restart, or stop condition.
     b3     IICSTIF - Issuing of Start, Restart, or Stop Condition Completed Flag
     - There are no requests for generating conditions
     b1     IICRSTAREQ - Start Condition Generation   - A restart condition is not generated. */
    pregs->SIMR3.BYTE = SCI_IIC_RST_CON_GENERATED;
} /* End of function sci_iic_re_start_cond_generate() */

/***********************************************************************************************************************
 * Function Name: sci_iic_stop_cond_generate
 * Description  : Generate Stop Condition Processing.
 *                Sets SCR register and SIMR3 register.
 * Arguments    : sci_iic_info_t * p_sci_iic_info     ;   IIC Information
 * Return Value : None
 **********************************************************************************************************************/
static void sci_iic_stop_cond_generate (sci_iic_info_t * p_sci_iic_info)
{
    sci_regs_t pregs = g_sci_iic_handles[p_sci_iic_info->ch_no]->prom->regs;

    /* Enables the IIC bus interrupt. */
    g_sci_iic_handles[p_sci_iic_info->ch_no]->mode = SCI_IIC_STPREQ; /* mode set stop mode. */

    /* SCR - Serial Control Register
     b5     TE - Transmit Enable - Serial transmission is enabled
     b4     RE - Transmit Enable - Serial reception is enabled */
    pregs->SCR.BYTE |= SCI_IIC_SCR_TE_RE;

    /* SIMR3 - I2C Mode Register 3
     b7:b6  IICSCLS - SSCL Output Select - Generate a start, restart, or stop condition.
     b5:b4  IICSDAS - SSDA Output Select - Generate a start, restart, or stop condition.
     b3     IICSTIF - Issuing of Start, Restart, or Stop Condition Completed Flag
     - There are no requests for generating conditions
     b2     IICSTPREQ - Start Condition Generation   - A stop condition is not generated. */
    pregs->SIMR3.BYTE = SCI_IIC_SP_CON_GENERATED;
} /* End of function sci_iic_stop_cond_generate() */

/***********************************************************************************************************************
 * Function Name: sci_iic_set_sending_data
 * Description  : Transmit Data Processing.
 *                Sets transmission data to TDR register.
 * Arguments    : sci_iic_info_t * p_sci_iic_info    ;   IIC Information
 *              : uint8_t * p_data                   ;   Transmitted data buffer pointer
 * Return Value : None
 **********************************************************************************************************************/
static void sci_iic_set_sending_data (sci_iic_info_t * p_sci_iic_info, uint8_t * p_data)
{
    sci_regs_t pregs = g_sci_iic_handles[p_sci_iic_info->ch_no]->prom->regs;

