eclipse-threadx/getting-started/Renesas/RX65N_Cloud_Kit/lib/rx_driver_package/src/smc_gen/r_sci_iic_rx/src/r_sci_iic_rx.c
    /* Sets the transmitting data. */
    pregs->TDR = (*p_data); /* Writes data to SCI_IIC in order to transmit.   */

    /* dummy read */
    if (pregs->TDR)
    {
        R_BSP_NOP();
    }
} /* End of function sci_iic_set_sending_data() */

/***********************************************************************************************************************
 * Function Name: sci_iic_get_receiving_data
 * Description  : Receive Data Processing.
 *                Stores received data from RDR register.
 * Arguments    : sci_iic_info_t * p_sci_iic_info     ;   IIC Information
 * Return Value : Returns received data.
 **********************************************************************************************************************/
static uint8_t sci_iic_get_receiving_data (sci_iic_info_t * p_sci_iic_info)
{
    uint8_t ret;
    sci_regs_t pregs = g_sci_iic_handles[p_sci_iic_info->ch_no]->prom->regs;

    ret = pregs->RDR;

    return ret;
} /* End of function sci_iic_get_receiving_data() */

/***********************************************************************************************************************
 * Function Name: sci_iic_iic_disable
 * Description  : Disable IIC Function Processing.
 *                Disables SCI_IIC communication and disables SCI_IIC multi-function pin controller.
 * Arguments    : sci_iic_info_t * p_sci_iic_info     ;   IIC Information
 * Return Value : None
 **********************************************************************************************************************/
static void sci_iic_iic_disable (sci_iic_info_t * p_sci_iic_info)
{
    sci_regs_t pregs = g_sci_iic_handles[p_sci_iic_info->ch_no]->prom->regs;
#if SCI_IIC_CFG_PORT_SETTING_PROCESSING
    R_BSP_VOLATILE_EVENACCESS const sci_iic_ch_rom_t * prom = g_sci_iic_handles[p_sci_iic_info->ch_no]->prom;
    
    uint8_t sscl_port_gr;
    uint8_t sscl_port_pin;
    uint8_t ssda_port_gr;
    uint8_t ssda_port_pin;
#endif

#if SCI_IIC_CFG_PORT_SETTING_PROCESSING
    /* Disables SCI_IIC multi-function pin controller after setting SCL and SDA to Hi-z by Reset. */
    /* Includes I/O register read operation at the end of the following function. */
    sscl_port_gr = prom->sscl_port_gr;
    sscl_port_pin = prom->sscl_port_pin;
    r_sci_iic_mpc_setting(sscl_port_gr, sscl_port_pin, SCI_IIC_MPC_SSCL_INIT);
    ssda_port_gr = prom->ssda_port_gr;
    ssda_port_pin = prom->ssda_port_pin;
    r_sci_iic_mpc_setting(ssda_port_gr, ssda_port_pin, SCI_IIC_MPC_SSDA_INIT);
#endif

    /* Resets SCI_IIC registers. */
    pregs->SCMR.BIT.SMIF = 0;
    pregs->SIMR1.BIT.IICM = 0;

    /* dummy read */
    if (pregs->SCMR.BYTE)
    {
        R_BSP_NOP();
    }
} /* End of function sci_iic_iic_disable() */

/***********************************************************************************************************************
 * Function Name: sci_iic_iic_enable
 * Description  : Enables SCI_IIC communication and enables SCI_IIC multi-function pin controller.
 * Arguments    : sci_iic_info_t * p_sci_iic_info     ;   IIC Information
 * Return Value : None
 **********************************************************************************************************************/
static void sci_iic_iic_enable (sci_iic_info_t * p_sci_iic_info)
{
    sci_regs_t pregs = g_sci_iic_handles[p_sci_iic_info->ch_no]->prom->regs;
#if SCI_IIC_CFG_PORT_SETTING_PROCESSING
    R_BSP_VOLATILE_EVENACCESS const sci_iic_ch_rom_t * prom = g_sci_iic_handles[p_sci_iic_info->ch_no]->prom;
    
    uint8_t sscl_port_gr;
    uint8_t sscl_port_pin;
    uint8_t ssda_port_gr;
    uint8_t ssda_port_pin;
    uint8_t sscl_en_val;
    uint8_t ssda_en_val;
#endif

    /* Enables SCI_IIC.*/
    pregs->SCMR.BIT.SMIF = 0;
    pregs->SIMR1.BIT.IICM = 1;

#if SCI_IIC_CFG_PORT_SETTING_PROCESSING
    /* Enables SCI_IIC multi-function pin controller.*/
    /* Includes I/O register read operation at the end of the following function. */
    sscl_port_gr = prom->sscl_port_gr;
    sscl_port_pin = prom->sscl_port_pin;
    sscl_en_val = prom->sscl_en_val;
    r_sci_iic_mpc_setting(sscl_port_gr, sscl_port_pin, sscl_en_val);
    ssda_port_gr = prom->ssda_port_gr;
    ssda_port_pin = prom->ssda_port_pin;
    ssda_en_val = prom->ssda_en_val;
    r_sci_iic_mpc_setting(ssda_port_gr, ssda_port_pin, ssda_en_val);
#endif
} /* End of function sci_iic_iic_enable() */

/***********************************************************************************************************************
 * Function Name: sci_iic_register_init_setting
 * Description  : SCI register Initial setting.
 * Arguments    : sci_iic_info_t * p_sci_iic_info     ;   IIC Information
 * Return Value : None
 **********************************************************************************************************************/
static void sci_iic_register_init_setting (sci_iic_info_t * p_sci_iic_info)
{
    sci_regs_t pregs = g_sci_iic_handles[p_sci_iic_info->ch_no]->prom->regs;

    /* Place the SSCL pin & SSDA pin in the high-impedance state */
    /* SIMR3 - I2C Mode Register 3
     b7:b6  IICSCLS - SSCL Output Select - Place the SSCL pin in the high-impedance state.
     b5:b4  IICSDAS - SSDA Output Select - Place the SSDA pin in the high-impedance state.
     b3     IICSTIF - Issuing of Start, Restart, or Stop Condition Completed Flag
     - There are no requests for generating conditions
     b2     IICSTPREQ  - Stop Condition Generation    - A stop condition is not generated.
     b1     IICRSTAREQ - Restart Condition Generation - A restart condition is not generated.
     b0     IICRSTAREQ - Start Condition Generation   - A start condition is not generated. */
    pregs->SIMR3.BIT.IICSCLS = SCI_IIC_HI_Z_OUTPUT; /* Output Hi-z */
    pregs->SIMR3.BIT.IICSDAS = SCI_IIC_HI_Z_OUTPUT; /* Output Hi-z */

    /* Set the data transmission/reception format in SMR, and SCMR. */
    /* SMR - Serial Mode Register
     b7     CM - Communications Mode - Asynchronous mode.
     b6     CHR - Character Length - Selects 8 bits as the data length.
     b5     PE - Parity Enable - Parity bit addition is not performed.
     b4     PM - Parity Mode - Selects even parity.
     b3     STOP - Stop Bit Length - 1 stop bit
     b2     MP  - Multi-Processor Mode - Multi-processor communications function is disabled.
     b1:b0  CKS - Clock Select - PCLK clock (n = 0) */
    pregs->SMR.BYTE = SCI_IIC_SMR_INIT; /* PCLK clock */

    /* Set the data transmission/reception format in SMR, and SCMR. */
    /* SMCR - Smart Card Mode Register
     b7     BCP2 - Base Clock Pulse 2 - 128 clock cycles (S = 128).
     b6:b4  Reserve - These bits are read as 1.
     b3     SDIR - Transmitted/Received Data Transfer Direction -Transfer with MSB-first.
     b2     SINV - Transmitted/Received Data Invert - Receive data is stored asit is in RDR.
     b1     Reserve - These bits are read as 1.
     b0     SMIF  - Smart Card Interface Mode Select - Serial communications interface mode. */
    pregs->SCMR.BIT.SDIR = SCI_IIC_MSB_FIRST;
} /* End of function sci_iic_register_init_setting() */

